//
//  LyricManager.swift
//  SongMaster
//
//  Created by RS-pax on 2017/12/16.
//  Copyright © 2017年 RS-pax. All rights reserved.
//

import Foundation

class LyricManager: NSObject {
    
    class func songList() -> [String] {
        return ["阴天快乐",
                "断点",
                "愿得一人心",
                "等一分钟",
                "父亲"
        ]
    }
    
    class func getLyricByIndex(index: Int) -> [String] {
        switch (index) {
        case 0:
            return 阴天快乐歌词();
        case 1:
            return 断点歌词();
        case 2:
            return 愿得一人心歌词();
        case 3:
            return 等一分钟歌词();
        case 4:
            return 父亲歌词();
        default:
            return [];
        }
    }
    
    class func 阴天快乐歌词() -> [String] {
        return ["天空它像什么",
                "爱情就像什么",
                "几多云在阴天忘了该往哪儿走",
                "思念和寂寞",
                "被吹进了左耳",
                "也许我记不住可是也忘不掉那时候",
                "那种秘密的快乐",
                "听阴天说什么",
                "在昏暗中的我",
                "想对着天讲",
                "说无论如何",
                "阴天快乐",
                "叫阴天别闹了",
                "想念你都那么久那么久了",
                "我一抬头 就看见你",
                "那个酒窝",
                "翻山越岭之后",
                "爱却神出鬼没",
                "你像一首唱到沙哑偏爱的情歌",
                "旅途中坐一坐",
                "在秋千上的我",
                "原来我忽略的如今想纪念也没用",
                "那些时光的因果",
                "听阴天说什么",
                "在昏暗中的我",
                "想对着天讲 说无论如何",
                "阴天快乐",
                "叫阴天别闹了",
                "想念你都那么久那么久了",
                "我一抬头 就看见你",
                "那个酒窝",
                "过去穿过了现在绕过了未来缝在心海中",
                "带着你我旅行变成老头",
                "孤单怕成了习惯所以我淡定走在人海中",
                "偶而想看云飞却没风",
                "听阴天说什么",
                "在昏暗中的我",
                "想对着天讲 说无论如何",
                "阴天快乐",
                "叫阴天别闹了",
                "想念你都那么久那么久了",
                "我一抬头 就看见了 当时的我"
        ];
    }
    
    class func 断点歌词() -> [String] {
        return ["静静地陪你走了很远很远",
                "连眼睛红了都没有发现",
                "听着你说你现在的改变",
                "看着我依然最爱你的笑脸",
                "这条旧路依然没有改变",
                "以往的每次路过都是晴天",
                "想起我们有过的从前",
                "泪水就一点一点开始蔓延",
                "我转过我的脸",
                "不让你看见",
                "深藏的暗涌已经越来越明显",
                "过完了今天就不要再见面",
                "我害怕每天醒来想你好几遍",
                "我吻过你的脸",
                "你双手曾在我的双肩",
                "感觉有那么甜我那么依恋",
                "每当我闭上眼我总是可以看见",
                "失信的诺言全部都会实现",
                "我吻过你的脸",
                "你已经不在我的身边",
                "我还是祝福你过得好一点",
                "断开的感情线我不要做断点",
                "只想在睡前再听见你的",
                "蜜语甜言",
                "静静地陪你走了好远好远",
                "连眼睛红了都没有发现",
                "听着你说你现在的改变",
                "看着我依然最爱你的笑脸",
                "这条旧路依然没有改变",
                "以往的每次路过都是晴天",
                "想起我们有过的从前",
                "泪水就一点一点开始蔓延",
                "我转过我的脸不让你看见",
                "深藏的暗涌已经越来越明显",
                "过完了今天就不要再见面",
                "我害怕每天醒来想你好几遍",
                "我吻过你的脸",
                "你双手曾在我的双肩",
                "感觉有那么甜我那么依恋",
                "每当我闭上眼我总是可以看见",
                "失信的诺言全部都会实现",
                "我吻过你的脸",
                "虽然你不在我的身边",
                "我还是祝福你过得好一点",
                "断开的感情线我不要做断点",
                "只想在睡前再听见你的",
                "蜜语甜言"
        ];
    }
    
    class func 愿得一人心歌词() -> [String] {
        return ["曾在我背包小小夹层里的那个人",
                "陪伴我漂洋过海经过每一段旅程",
                "隐形的稻草人",
                "守护我的天真",
                "曾以为爱情能让未来只为一个人",
                "关了灯依旧在书桌角落的那个人",
                "变成我许多年来纪念爱情的标本",
                "消失的那个人",
                "回不去的青春",
                "忘不了爱过的人才会对过往认真",
                "只愿得一人心",
                "白首不分离",
                "这简单的话语",
                "需要巨大的勇气",
                "没想过失去你",
                "却是在骗自己",
                "最后你深深藏在我的歌声里",
                "只愿得一人心",
                "白首不分离",
                "这清晰的话语",
                "嘲笑孤单的自己",
                "盼望能见到你",
                "却一直骗自己",
                "遗憾你听不到我唱的这首歌 多想唱给你",
                "曾在我背包小小夹层里的那个人",
                "陪伴我漂洋过海经过每一段旅程",
                "隐形的稻草人",
                "守护我的天真",
                "曾以为爱情能让未来只为一个人",
                "关了灯依旧在书桌角落的那个人",
                "变成我许多年来纪念爱情的标本",
                "消失的那个人",
                "回不去的青春",
                "忘不了爱过的人才会对过往认真",
                "只愿得一人心",
                "白首不分离",
                "这简单的话语",
                "需要巨大的勇气",
                "没想过失去你",
                "却是在骗自己",
                "最后你深深藏在我的歌声里",
                "只愿得一人心",
                "白首不分离",
                "这清晰的话语",
                "嘲笑孤单的自己",
                "盼望能见到你",
                "却一直骗自己",
                "遗憾你听不到我唱的这首歌",
                "只愿得一人心",
                "白首不分离",
                "这简单的话语",
                "需要巨大的勇气",
                "没想过失去你",
                "却是在骗自己",
                "最后你深深藏在我的歌声里",
                "只愿得一人心",
                "白首不分离",
                "这清晰的话语",
                "嘲笑孤单的自己",
                "我很想你",
                "却一直骗自己",
                "遗憾你听不到我唱的这首歌 多想唱给你"
        ];
    }
    
    class func 等一分钟歌词() -> [String] {
        return ["如果时间",
                "忘记了转",
                "忘了带走什么",
                "你会不会",
                "至今停在说爱我的那天",
                "然后在世界的一个角",
                "有了一个我们的家",
                "你说我的胸膛会让你感到暖",
                "如果生命",
                "没有遗憾",
                "没有波澜",
                "你会不会",
                "永远没有说再见的一天",
                "可能年少的心太柔软",
                "经不起风经不起浪",
                "若今天的我能回到昨天",
                "我会向自己妥协",
                "我再等一分钟",
                "或许下一分钟",
                "看到你闪躲的眼",
                "我不会让伤心的泪挂满你的脸",
                "我再等一分钟",
                "或许下一分钟",
                "能够感觉你也心痛",
                "那一年我不会让离别成永远",
                "如果生命",
                "没有遗憾",
                "没有波澜",
                "你会不会",
                "永远没有说再见的一天",
                "可能年少的心太柔软",
                "经不起风经不起浪",
                "若今天的我能回到昨天",
                "我会向自己妥协",
                "我再等一分钟",
                "或许下一分钟",
                "看到你闪躲的眼",
                "我不会让伤心的泪挂满你的脸",
                "我再等一分钟",
                "或许下一分钟",
                "能够感觉你也心痛",
                "那一年我不会让离别成永远",
                "我再等一分钟",
                "或许下一分钟",
                "看到你不舍的眼",
                "我会用一个拥抱换取你的转身",
                "我再等一分钟",
                "或许下一分钟",
                "如果你真的也心痛",
                "我会告诉你我的胸膛依旧暖",
                "那一年我不会让离别成永远"
        ];
    }
    
    class func 父亲歌词() -> [String] {
        return [
            "总是向你索取 却不曾说谢谢你",
            "直到长大以后 才懂得你不容易",
            "每次离开总是 装作轻松的样子",
            "微笑着说回去吧 转身泪湿眼底",
            "多想和从前一样 牵你温暖手掌",
            "可是你不在我身旁 托清风捎去安康",
            "时光时光慢些吧 不要再让你变老了",
            "我愿用我一切 换你岁月长留",
            "一生要强的爸爸 我能为你做些什么",
            "微不足道的关心 收下吧",
            "谢谢你做的一切 双手撑起我们的家",
            "总是竭尽所有 把最好的给我",
            "我是你的骄傲吗 还在为我而担心吗",
            "你牵挂的孩子啊 长大啦",
            "多想和从前一样 牵你温暖手掌",
            "可是你不在我身旁 托清风捎去安康",
            "时光时光慢些吧 不要再让你变老了",
            "我愿用我一切 换你岁月长留",
            "一生要强的爸爸 我能为你做些什么",
            "微不足道的关心 收下吧",
            "谢谢你做的一切 双手撑起我们的家",
            "总是竭尽所有 把最好的给我",
            "我是你的骄傲吗 还在为我而担心吗",
            "你牵挂的孩子啊 长大啦",
            "时光时光慢些吧 不要再让你变老啦",
            "我愿用我一切 换你岁月长留",
            "我是你的骄傲吗 还在为我而担心吗",
            "你牵挂的孩子啊 长大啦",
            "感谢一路上有你"
        ]
    }
}
